#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cdn.azurerm_dns_a_record.this has moved to module.dns.azurerm_dns_a_record.this
    resource "azurerm_dns_a_record" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/wallet.io.pagopa.it/A/@"
        name                = "@"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)
    }

  # module.dns.azurerm_dns_txt_record.cbor_wallet_io_pagopa_it will be created
  + resource "azurerm_dns_txt_record" "cbor_wallet_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cbor"
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "wallet.io.pagopa.it"

      + record {
          + value = "mku7fqer6d"
        }
    }

  # module.dns.azurerm_dns_txt_record.proximity_wallet_io_pagopa_it will be created
  + resource "azurerm_dns_txt_record" "proximity_wallet_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "proximity"
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "wallet.io.pagopa.it"

      + record {
          + value = "sh4ibgibuy"
        }
    }

  # module.cdn.azurerm_dns_txt_record.wallet_io_pagopa_it has moved to module.dns.azurerm_dns_txt_record.wallet_io_pagopa_it
    resource "azurerm_dns_txt_record" "wallet_io_pagopa_it" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/wallet.io.pagopa.it/TXT/@"
        name                = "@"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.iam.azurerm_role_assignment.infra_cd_subscription_rbac_admin will be created
  + resource "azurerm_role_assignment" "infra_cd_subscription_rbac_admin" {
      + condition_version                = (known after apply)
      + description                      = "Allow io-wallet Infra CD identity to manage the wallet DNS zone"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9715d78c-6f0f-4cda-800f-205ea137a8eb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/wallet.io.pagopa.it"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
